const Aboutus = () => {
  const primaryColor = "";
  const secondaryColor = "";
  return (
    <>
      <section
        id="about-us"
        className="mx-auto w-full max-w-[1150px]  bg-[var(--sec)]/15 relative px-6 md:px-0 py-20 md:pb-28"
      >
        <div className="text-center mb-10 md:mb-10 space-y-3">
          <h2
            style={{ color: primaryColor }}
            className="font-hedvig text-[28px] md:text-[45px] font-[400] leading-tight pb-8"
          >
            KARNATAKA RAJYA MADIVALARA <br></br>
            SANGHA
          </h2>

          <div className="relative space-y-4">
            <p className="text-[#636363] text-[16px] font-inter">
              ಈ ಸಂಘವು 1933 ರಲ್ಲಿ ಪ್ರಾರಂಭವಾಗಿಇದುವರೆವಿಗೂ ಸಂಘದಉನ್ನತ ಪದವಿ
              ರಾಜ್ಯಾಧ್ಯಕ್ಷ ಸ್ಥಾನವನ್ನು ಅಲಂಕರಿಸಿದ 14 ಮಂದಿ ಅಧ್ಯಕ್ಷರು ಸಂಘದಕಾರ್ಯ
              ಚಟುವಟಿಕೆಗಳನ್ನು ಮುನ್ನಡೆಸಿಕೊಂಡು ಹೋಗುತ್ತಿದ್ದರು. ಆಗ ಕರ್ನಾಟಕರಾಜ್ಯ
              ಮಡಿವಾಳರ ಸಂಘವು ಬೆಂಗಳೂರಿಗೆ ಮಾತ್ರ ಸೀಮಿತವಾಗಿತ್ತು. 15-07-2013 ರಲ್ಲಿ
              ಸಂಘದರಾಜ್ಯಾಧ್ಯಕ್ಷ ಸ್ಥಾನಕ್ಕೆ ಪದಗ್ರಹಣ ಮಾಡಿದ ಶ್ರೀ ಸಿ.ನಂಜಪ್ಪ
              ರವರುದುರ್ಬಲರ ಶೋಷಣೆ , ಜಾತೀಯತೆ , ಮೇಲು ಕೀಳು ತಾರತಮ್ಯ , ಅಸ್ಪøಶ್ಯತೆ ,
              ಮೂಡನಂಬಿಕೆಗಳು , ಶಿಕ್ಷಣದಲ್ಲಿ ಅವಕಾಶ ವಂಚನೆ ಹೀಗೆ ಅನೇಕ ಅಸಮಾನತೆಗಳಿಂದ
              ತುಳಿತಕ್ಕೆ ಒಳಗಾಗಿದ್ದ ರಾಜ್ಯದಲ್ಲಿನ ಮಡಿವಾಳ ಜನಾಂಗವನ್ನು ಸಮಾಜದ
              ಮುಖ್ಯವಾಹಿನಿಗೆ ತರುವ ನಿಟ್ಟಿನಲ್ಲಿರಾಜ್ಯದ ಮೂಲೆ ಮೂಲೆಗಳಿಗೂ ಪ್ರವಾಸಕೈಗೊಂಡು,
              ರಾಜ್ಯದಎಲ್ಲಾಜಿಲ್ಲೆ ಮತ್ತುತಾಲ್ಲೂಕು ಪದಾಧಿಕಾರಿಗಳನ್ನು ನೇಮಿಸಿ ಆಯಾ
              ಭಾಗಗಳಲ್ಲಿ ಮಡಿವಾಳರ ಸ್ಥಿತಿ ಗತಿಗಳ ವಿವರಗಳನ್ನು ಪಡೆದು, ಮಡಿವಾಳರ ಕೂಗು
              ಸರ್ಕಾರದ ಗಮನಕ್ಕೆ ತರುವುದಕ್ಕಾಗಿ, ಸಂಘಟನೆಯ ಮೂಲಕ, ಕೂಡಲಸಂಗಮ , ಮೈಸೂರು ,
              ಬೆಂಗಳೂರಿನ ನ್ಯಾಷನಲ್‍ಕಾಲೇಜು ಮೈದಾನ , ಚಿತ್ರದುರ್ಗಗುರುಪೀಠ , ಮಂಡ್ಯ ,
              ಗಳಲ್ಲಿ ಅಂದಿನ ಸರ್ಕಾರಗಳ ಮುಖ್ಯ ಮಂತ್ರಿಗಳು ಮತ್ತು ಮಂತ್ರಿವರ್ಗದ
              ಪ್ರಮುಖರನ್ನು ಕರೆಸಿ ಸಮಾವೇಶಗಳನ್ನು ಮಾಡಿದ್ದರ ಫಲವಾಗಿ,
            </p>
          </div>
        </div>
      </section>
    </>
  );
};
export default Aboutus;
